#include"NPC.h"

void Npc::NpcChat(int position, int StoryFlag)
{
	if (position == 0 && StoryFlag == 0)//清风镇
	{
		cout << "你：好久不见，雪昭姑娘，不知最近可有怪事发生?" << endl;
		system("pause");
		cout << "郑雪昭：当然有，我的天啊，王大爷家的闺女大晚上的消失了！现在整个镇上的人都找疯了,谁不知道王大爷是当地的地头蛇与财神爷啊，居然做出这种事情。" << endl;
		system("pause");
		cout << "你：不知道王大爷家的闺女漂亮不，呃，我的意思是，不知道什么人会做出这种事情！" << endl;
		system("pause");
		cout << "郑雪昭看了你一眼，凑过来悄悄跟你说：我听说王大爷一直想要炼出一把至邪之剑，但苦于没有材料很久了而他闺女又是阴年阴月阴日生的，所以......" << endl;
		system("pause");
		cout << "你的直觉告诉你关键的问题就在这里，然后再找找问题的关键就行-乌鸦的翅膀啪的一下打到了你的头上，还不快去！走进王府，收起身上的铁丝，你心中一凛，有鬼气！若有若无的危机感萦绕在你的心头，一道剑气袭来" << endl;
		system("pause");
		//进入战斗，此部分交给fight，
		// 王大爷清醒过后很感谢你，为报答你给予你50铜钱和人参果。  获得50铜钱，人参果*2
		// 前往三凤山
		//战斗结束后，StoryFlag++，当前flag为1
	}
	if (position == 1 && StoryFlag == 1)//三凤山
	{
		cout << "你：老人家，请问附近可有歇脚的地方？" << endl;
		system("pause");
		cout << "山中老者：不嫌弃的话就来我家休息吧" << endl;
		system("pause");
		cout << "......在家中闲谈老者突然提及到伥鬼，你很好奇" << endl;
		system("pause");
		cout << "你：伥鬼是个什么玩意，很厉害吗？" << endl;
		system("pause");
		cout << "老者:伥鬼啊，就是被老虎吃掉而化做鬼魂，为非作歹，引诱他人被老虎吃掉，咱们这山中已经有好几个年轻小伙都失踪了，我估计啊净都是被那伥鬼迷了神入了虎口哇" << endl;
		system("pause");
		cout << "你：附近经常有老虎出没吗？" << endl;
		system("pause");
		cout << "老者：咱们这呀就叫三凤山，老虎呀一般都在山腰以上，不过那里崎岖坎坷，路也不好走，可不要好奇去那里呀" << endl;
		system("pause");
		cout << "你：嗯好的，谢谢老人家了" << endl;
		system("pause");
		cout << "......经过一晚的休息，你还是决定往山上走去去看看" << endl;
		system("pause");
		cout << "走了不久，你发现有人呼救，你顺着声音赶了过去，发现一位年轻女子瘫倒在地，脚被荆棘划伤" << endl;
		system("pause");
		cout << "女子：求求你帮帮我，我原本想为我父母采药，结果我不小心受伤了，这里有老虎出没，能帮帮我离开这吗？" << endl;
		system("pause");
		cout << "你背起女子听着她的指引前进，你发现道路越来越难走，心中隐隐担心。突然一声虎啸，一只庞大老虎从草丛窜出划伤了你的身体，背上的女子发出奸邪的笑，此时你发现那竟是一只伥鬼，可是你身受重伤无法反击，眼看就要命入虎口。" << endl;
		system("pause");
		cout << "伴随着一声枪响，昨晚的老者提着一把猎枪赶来击中老虎头部，你顺势开始追赶伥鬼" << endl;
		system("pause");
		//进入战斗，此部分交给fight，
		// 老者将死去的老虎皮送给你，你售卖后获得70铜钱。  获得70铜钱
		// 前往云中池
		//战斗结束后，StoryFlag++，当前flag为2
	}
	if (position == 2 && StoryFlag == 2)//云中池
	{
		cout << "王韩羽：这里真的是桃花流水鳜鱼肥啊，居住在此处真的是一大幸事，小兄弟来到此处可有何事？" << endl;
		system("pause");
		cout << "你：我从清风镇过来，四处游玩。" << endl;
		system("pause");
		cout << "王韩羽：看你相貌堂堂，肯定是成大事之人，不知兄台高就？" << endl;
		system("pause");
		cout << "你：没有没有，就会一些奇门技巧罢了。这里有什么特别的事情吗？" << endl;
		system("pause");
		cout << "王韩羽：你一提醒我倒是想起来一件事，那就是最近那个池中有时发出阵阵恶臭，鱼也死了很多，听村里老人说，下面可能有脏东西，前几天还有人失踪了，可也没人敢下去看看。" << endl;
		system("pause");
		cout << "你：能带我去探个究竟吗？" << endl;
		system("pause");
		cout << "......你来到池边，确实池中传来阵阵恶臭，胃里不免翻江倒海。池水依然一滩寂静，你察觉到水下必有异常，你潜伏在在旁边的草丛一直待到夜晚降临，王韩羽觉得害怕离开了此处。突然，水草像是被什么挥开一样，一个黑色的身影从水里缓缓走出，如你猜想的一样。你大喝一声跳出来准备大干一场" << endl;
		system("pause");
		//进入战斗，此部分交给fight，
		// 狰狞的水鬼化作一滩黑水，王韩羽认出那个水鬼是他的一位好朋友，为答谢你，赠予你一件他家留存下来的一件白色道袍还有少许糯米。 获得白色道袍*1，糯米*1，30铜钱
		// 前往陷土沼泽
		//战斗结束后，StoryFlag++，当前flag为3
	}
	if (position == 3 && StoryFlag == 3)//陷土沼泽
	{
		cout << "你来到一片废土，这里荒无人烟，面前的大路也被滑落的巨石挡住，只剩下一片沼泽可以勉强通过。你只好沿着沼泽继续往前走，走了很久很久，天色逐渐都黑了下了，还没有走出沼泽地，可你愈发感觉脚越发沉重，感觉身体在下沉，像是有什么拖拽你一样。一只布满蛆虫的黑手抓住了的脚，你大感不妙，想挣扎却使不上劲，（奇遇二）。" << endl;
		system("pause");
		cout << "陈大壮告诉你这里有许多路人失踪，可能被邪恶之徒用来炼蛊。你着手开始调查，在一处密穴之中闻到一股很浓的血腥味，你隐秘在黑暗之中缓缓前进，一只偌大的蜈蚣爬到你身上，你赶紧抖落掉蜈蚣，那只布满蛆虫的黑手再次朝你袭来" << endl;
		system("pause");
		cout << "你堪堪躲过" << endl;
		system("pause");
		cout << "巫婆（练蛊之人）：没想到小小年纪能力倒不小呢，我倒要看看你还有多少本事" << endl;
		system("pause");
		cout << "三具布满窟窿丑陋至极的尸体腾地站起朝你扑来" << endl;
		system("pause");
		
		//进入战斗，此部分交给fight，
		// 巫婆的蛊虫死亡受到反噬倒地不起，你从她的各种练蛊物品中发现了至宝。  获得五毒粉*1，50铜钱
		// 前往阴邪
		//战斗结束后，StoryFlag++，当前flag为4
	}
	if (position == 4 && StoryFlag == 4)//阴邪
	{
		cout << "跨过陷土沼泽的你来到了一片死寂之地，这里阴气环绕，你猜测这里百鬼横行，有大凶之兆，本想离开此处，却隐约听见有声音在呼唤你深入探索，你顺着声音逐渐深入" << endl;
		system("pause");
		cout << "这里枯草丛生，高大的树木遮天蔽日，乌鸦的啼叫惹得你心神不宁，一群长相凶恶，高大强壮的怪物出现在你的眼前，手上挥舞着插满钉子的大锤朝你狠狠袭来" << endl;
		system("pause");
		cout << "这些怪物十分凶恶，不过你还是处理好了" << endl;
		system("pause");
		cout << "看着倒下的几具庞大的尸体不禁感到后怕，更不敢想象最里面会有什么更可怕的东西在等着你" << endl;
		system("pause");
		cout << "你来到了一个类似祭坛的地方，周围鬼火缭绕，祭坛中心用红石粉画着极其诡异的符文，四周响起狰狞的嚎叫与咒文，一个若隐若现、比你高出数尺的黑色骷髅手持镰刀出现在你面前。" << endl;
		system("pause");
		cout << "骷髅：你听到了我的召唤而来，让我吸收掉你的精气助我获得更强的力量吧，整个世界必将笼罩在黑暗之" << endl;
		system("pause");
		cout << "你：也得看你有多大本事了" << endl;
		system("pause");
		//进入战斗，此部分交给fight，
		// 骷髅化作虚无消失了，却留下了最后一句话：这仅仅是开始而已。获得丹心丸*1，50铜钱
		// 前往弘阳镇
		//战斗结束后，StoryFlag++，当前flag为5
	}
	if (position == 5 && StoryFlag == 5)//弘阳镇
	{
		cout << "走在去弘阳镇的路上，刚才经过清风镇又遇见了郑雪昭，真是一个有趣的人" << endl;
		system("pause");
		cout << "（回忆）：" << endl <<"郑雪昭：你终于回来啦，可经历了啥有趣的事快讲讲" << endl;
		system("pause");
		cout << "（回忆）：" << endl << "你：这一路我......" << endl;
		system("pause");
		cout << "（回忆）：" << endl << "郑雪昭：你太厉害了吧，以后有这种事情带我一起去看看嘛" << endl;
		system("pause");
		cout << "（回忆）：" << endl << "你：这么危险有啥好看的呀" << endl;
		system("pause");
		cout << "（回忆）：" << endl << "乌鸦先生：早知道你会发生这些事啦，我从弘阳镇回来，他们那里瘟疫横行，可是医生又检查不出到底有啥问题，身体各项指针都没问题，我觉得你会有办法的" << endl;
		system("pause");
		cout << "（来到了弘阳镇）" << endl;
		system("pause");
		cout << "村民：年轻人，我们这里奇怪的很哇，好多人莫名其妙地染上了病，医生也束手无策，你就别来了把，要是也被感染了就糟了" << endl;
		system("pause");
		cout << "你：没事的，我略微懂得一点医术，想来看看有没有什么能帮助的" << endl;
		system("pause");
		cout << "你用符纸加山泉水炼制了一大锅药水给染病的人们喝了之后，身体有些好转，都纷纷恳求你能够治好他们的疾病" << endl;
		system("pause");
		cout << "你心想：这个办法只能缓解不是长久之计，里面肯定有猫腻" << endl;
		system("pause");
		cout << "夜半三更之后，你躲在医院的病房里，里面还有许多躺在病床上休息的病人。夜里安静的可怕，随着墙上的时钟指针滴答滴答地响个不停，一阵稀碎的脚步声，更像是小孩子跑步的那种声音从房门外传来，房门吱呀一声缓缓打开，灯光也突然熄灭，你屏气凝神看看到底是个什么玩意。一个矮小的黑影在各个病人身边吸食着什么，你一惊发出了声音，它转过180度的头背朝着你，面带瘆人的微笑，你感到头昏脑胀一阵恶心，幸好早有准备喝了定神的符水。你勉强站了起来耗尽力气用红绳捆住了那个怪物拉着它离开了医院" << endl;
		system("pause");
		cout << "你：果真是你，疟疾鬼" << endl;
		system("pause");
		cout << "疟疾鬼：没想到又见面了，我说过那只是个开始" << endl;
		system("pause");
		cout << "你浸出了一身冷汗，可是你也毫无畏惧" << endl;
		system("pause");
		cout << "你：呵，没死透呢，再来吧" << endl;
		system("pause");
		//进入战斗，此部分交给fight，
		// 弘阳镇的百姓都很感谢你治好了他们的疾病，你只告诉他们是因为气候问题导致的让他们安心，他们为了答谢你赠予你许多有价值的东西。获得人参果*2，糯米*2，50铜钱
		// 前往奇龙镇
		//战斗结束后，StoryFlag++，当前flag为6
	}
	if (position == 6 && StoryFlag == 6)//奇龙镇
	{
		cout << "顺着大路你来到了一个名叫奇龙镇的地方，明明有很多住户的地方却死气沉沉，偶尔能看见几个行人，想开口去问却也大步离开，神色慌张似乎发生了啥事。你偷偷跑到一户人家的窗前朝里观望，发现一个年轻小伙躺在床上面带笑容，时不时发出正常却又显得可怖的笑声" << endl;
		system("pause");
		cout << "你一个翻身潜进了家里想查看到底是什么情况，这时一个老奶奶出现在你的身后"
			 <<endl<<"老奶奶：他呀是我的孩子，不知道最近到底是造了什么孽呀，好多人就这么一睡不醒，可是有都带着笑容，我的孩子也成了这副模样，造孽呀" << endl;
		system("pause");
		cout << "你：您也别太担心，我看他身体还没多大损伤，估计这症状开始还没多久。您说很多人都有这症状？" << endl;
		system("pause");
		cout << "老奶奶：是呀，乡里的老道士说是被一种叫山魈的怪物给迷了魂，沉浸在梦中直到死亡" << endl;
		system("pause");
		cout << "你：今晚能在您家住宿一晚吗，我也想好好调查一下" << endl;
		system("pause");
		cout << "老奶奶：这有好几间空房呢，随便找一间住下吧" << endl;
		system("pause");
		cout << "夜幕降临后，月光洒在窗前还是很美丽，不过这种情况你也没太大把握，翻来覆去最终还是困意来袭沉入梦乡。" << endl;
		system("pause");
		cout << "你恍惚中来到了一片森林之中，大雾弥漫，能见度不足五米，你摸索着想要走出这里，却好像始终在原地绕圈。你开始施法求仙指路，却没得到任何回应。身体也突然不受控制，仿佛沉入深水之中，呼吸不畅。你咬破舌尖，口吐咒语，然后你猛地惊醒，翻身下床，衣服早已被汗水浸湿。" << endl;
		system("pause");
		cout << "床另一边的黑影传来声音"
			 <<endl<<"山魈：你竟然能逃脱梦境，还是低估了你的实力" << endl;
		system("pause");
		cout << "你：那看来不得不把你给收拾了" << endl;
		system("pause");
		//进入战斗，此部分交给fight，
		// 山魈逐渐消亡：还没结束呢  获得100铜钱
		//镇上的人们都恢复了正常，对于那些人来说就像做了一个很长的美梦，你不断回想着你的那个梦，实在是太过真实，决定继续追查
		//请前往迷雾森林
		//战斗结束后，StoryFlag++，当前flag为7
	}
	if (position == 7 && StoryFlag == 7)//迷雾森林
	{
		cout << "你绕着三凤山来到了迷雾森林，很多人提及到此处都是汗毛直立，许多人进去后再也没出来过，有些人侥幸逃出来只是大叫着有怪物 ，因此无人再敢涉足。" << endl;
		system("pause");
		cout << "乌鸦先生在这里等候你许久了" << endl
			 << "乌鸦先生：我预料到你会来到这里，不过之后的事情我预见不了了，估计此行凶多吉少呀，你要做好准备。";
		system("pause");
		cout << "这里的场景跟你梦中的模样极为相似，你也开始感到了害怕。当恐惧被无限放大的时候，等待你的将是更深的黑暗" << endl;
		system("pause");
		cout << "三只各不相同鬼怪在迷雾中穿梭，你严正以待，它们庞大的身影飘浮到你眼前，正是魑、魅、魍魉。之前山魈给你留下的梦魇不断侵蚀着你的魂魄，恐惧想要占据你的身体" << endl;
		system("pause");
		
		//进入战斗，此部分交给fight，
		// ......战斗结束 获得200铜钱，人参果*1魑魅魍魉变成一团黑气逃走了，你奋力追赶，心想势必要彻底消灭他们
		// 请前往云龙峰
		//战斗结束后，StoryFlag++，当前flag为8
	}
	if (position == 8 && StoryFlag == 8)//云龙峰
	{
		cout << "这里更是陡峭崎岖，峰顶上魔气包裹，你紧念咒语定住心神，朝着峰顶艰难走去。婴儿的啼哭从峰顶传来，你心里一阵疑惑，此处怎会有婴儿啼哭声呢。随之而来是一个羊身人面其目在腋下，虎齿人爪的庞大怪物" << endl;
		system("pause"); 
		cout << endl << endl;
		system("color F4");
		cout <<'\t'<<'\t' << "饕餮!" << endl;
		cout << endl << endl;
		system("color 0F");
		system("pause");
		cout << "饕餮：你终究还是来到了这里，这一路居然都没能把你消灭掉，这次你就别想再活下去了" << endl;
		system("pause");
		cout << "你：你贪欲太重，成了如此人不人鬼不鬼的模样，妄图吞噬整个人间，实乃罪大恶极，就让我替天行道将你消灭了吧！" << endl;
		system("pause");
		cout << "饕餮：我本无我，皆因世间人心贪念，幻化成了如今模样，你们贪念越重我越强大，这是你们自找的" << endl;
		system("pause");
		cout << "你：既然如此，我就更要消灭你了，就算拼了命也要把你彻底铲除" << endl;
		system("pause");
		//进入战斗，此部分交给fight，
		// 受到重创的饕餮：可惜啊还是没能吃掉你，我不甘心啊
		/*你：贪念终究会败在自己身上，你这也算是自食其果
			饕餮已亡，魔气散去，世间又恢复到光明的样子*/
		
		//剧情结束
	}
	else
	{
		cout << "你在别处还有任务未完成" << endl;
		StoryPs(position, StoryFlag);
	}
}
void Npc::StoryPs(int position, int StoryFlag)
{
	if (position == 0 && StoryFlag == 0)
		cout << "当前任务为清风镇任务，请前往清风镇" << endl;
	if (position == 1 && StoryFlag == 1)
		cout << "当前任务为三凤山任务，请前往三凤山" << endl;
	if (position == 2 && StoryFlag == 2)
		cout << "当前任务为云中池任务，请前往云中池" << endl;
	if (position == 3 && StoryFlag == 3)
		cout << "当前任务为陷土沼泽任务，请前往陷土沼泽" << endl;
	if (position == 4 && StoryFlag == 4)
		cout << "当前任务为阴邪任务，请前往阴邪" << endl;
	if (position == 5 && StoryFlag == 5)
		cout << "当前任务为弘阳镇任务，请前往弘阳镇" << endl;
	if (position == 6 && StoryFlag == 6)
		cout << "当前任务为奇龙镇任务，请前往奇龙镇" << endl;
	if (position == 7 && StoryFlag == 7)
		cout << "当前任务为迷雾森林任务，请前往迷雾森林" << endl;
	if (position == 8 && StoryFlag == 8)
		cout << "当前任务为云龙峰任务，请前往云龙峰" << endl;
}
